Repository: mozilla-l10n/mt-training-data
Catalog: ses/ses_pontoon.tmx
Source language: en_us
Languages: ses

source: 1 of %d files
ses: 1 ka hun tuku %d ra

source: %1$@ on %2$@
ses: %1$@ %2$@ ga

source: About
ses: Fahami

source: Account Verification Required
ses: A ga waažibi kontoo m'alhakiikandi

source: Add
ses: Tonton

source: Add Bookmark
ses: Doo-šilbaa tonton

source: Added page to Reading List
ses: Moɲoo tonton caw maašeedaa ga

source: Added Search engine!
ses: Ceecijinay tontonante!

source: Added to Reading List
ses: A tontonandi cawyan maašeedaa ga

source: Added To Reading List
ses: Tontonandi caw maašeedaa ga

source: Address and Search
ses: Aderesu nda ceeciyan

source: Add Search Engine
ses: Ceecijinay tonton

source: Add Search Provider?
ses: Ceeci nookaw tonton?

source: Add Tab
ses: Kanji tonton

source: Add to Bookmarks
ses: Tonton doo-šilbawey ga

source: Add to Reading List
ses: Tonton caw maašeedaa ga

source: A device has disconnected from Firefox Sync
ses: Jinay dobante foo hun Firefox Sync ga

source: Ad trackers
ses: Feeyan ganakey

source: Advanced
ses: Jinekoyante

source: After 10 minutes
ses: Miniti 10 banda ga

source: After 15 minutes
ses: Miniti 15 banda ga

source: After 1 hour
ses: Guuru 1 banda ga

source: After 1 minute
ses: Miniti 1 banda ga

source: After 5 minutes
ses: Miniti 5 banda ga

source: Align QR code within frame to scan
ses: QR tammaasa dam kungaa ra ka biyoo za

source: Allow Firefox to use my Photos
ses: Naŋ Firefox ma goy nd'ay biyey

source: Allows some trackers so websites function properly.
ses: Ganakaw fooyaŋ naŋ hala nungey ma dira ka boori.

source: Allow Third-Party Keyboards
ses: Kufalwalha taney noo fondo

source: Always
ses: Waati kul

source: Always Send
ses: Sanba waati kul

source: A modern mobile browser from Mozilla, the non-profit committed to a free and open web.
ses: Hõ zaman kanbe ceecijinay kaŋ Mozilla n'a tee, baytal goymee interneti hegante nda feerante se.

source: Analytic trackers
ses: Korošiyan ganakey

source: An error occured while adding the pass to Wallet. Please try again later.
ses: Firka bangay waatoo kaŋ war ga Pass tonton Wallet ga. Ceeci koyne hiino.

source: Are you sure?
ses: War ga alhakiika?

source: Are you sure you want to cancel this download?
ses: Alhakiika war ga boona ka zumandiyanoo woo naŋ?

source: Are you sure you want to clear all of your data? This will also close all open tabs.
ses: Alhakiika kaŋ war ga baa ka war bayhayey kul tuusu? Woo ga war kanjey da kul daabu.

source: Are you sure you want to delete it and its contents?
ses: Alhakiika war ga baa k'a tuusu nda nga gundekunaa?

source: A search engine with this title or URL has already been added.
ses: Ceecijinay nda moɲoo wala URL woo n' ka tontonandi ka ben.

source: A username and password are being requested by %@.
ses: Maa kanbari nda šennikufal ga hãandi ne %@ se.

source: A username and password are being requested by %1$@. The site says: %2$@
ses: Goykaw maa nda šennikufal goo ma hãandi %1$@ se. Nungoo din nee: %2$@

source: Authentication required
ses: Tabatandiyan ga waažibi

source: Automatically
ses: Ga tee nga boŋ se

source: Available Credentials:
ses: Alhaku tammaasa barantey:

source: Available devices:
ses: Jinay barantey:

source: Back
ses: Banda

source: Back to Themes
ses: Willi furarey ga

source: Basic (Recommended)
ses: Šintin (yaamarante)

source: Be on the Lookout
ses: Guna haya tejey se

source: Blank Page
ses: Moo koonu

source: Block Lists
ses: Maašeedawey gagay

source: Block online trackers
ses: Interneti-ra ganakey gagay

source: Block Pop-up Windows
ses: Ceberi bata zanfuney gagay

source: Blocks known trackers. Some websites may not function properly.
ses: Ga ganakaw bayantey gagay. A ga tee kaŋ nungu fooyaŋ ši dira ka boori.

source: Bookmark
ses: Doo-šilbay

source: Bookmark Added
ses: Doo-šilbay tontonante

source: Bookmarked
ses: Šilbante

source: Bookmark Removed
ses: Doo-šilbay hunnante

source: Bookmarks
ses: Doo-šilbawey

source: Bookmarks Menu
ses: Doo-šilbawey šilbayboŋ

source: Bookmarks Toolbar
ses: Doo-šilbawey goyjinay žeeri

source: Bookmarks you save will show up here.
ses: Doo-šilbawey kaŋ war g'i gaabu ga fatta ne.

source: Bookmark This Page
ses: Moɲoo woo šilbay

source: Brightness
ses: Gaayay

source: Browse like no one’s watching
ses: Naaru sanda boro kul šii ma guna

source: Browse multiple Web pages at the same time with tabs.
ses: Interneti booboyaŋ ceeci nda kanjey waati follokaa ra.

source: Browsing History
ses: Ceeciyan taariki

source: Cache
ses: Tugudoo

source: Call
ses: Ciya

source: Cancel
ses: Naŋ

source: Cancel Download
ses: Zumandiyanoo naŋ

source: Cannot Open Page
ses: Ši hin ka moɲoo feeri

source: Change Passcode
ses: Bisayan kufal barmay

source: Changes color theme.
ses: Ga noone leeti barmay.

source: Changes font type.
ses: Ga šigira dumi barmay.

source: Choose
ses: Suuba

source: Choose Theme
ses: Furari suuba

source: Choose what to load when opening a new tab
ses: Suuba woo kaŋ mma zumandi nda kanji taaga ga feera

source: Clear
ses: Kaa

source: Clear All Website Data
ses: Interneti nungu bayhayey kul kaa

source: Clear Everything
ses: Hayakul tuusu

source: Clear Private Data
ses: Sutura bayhayey tuusu

source: Clear Search
ses: Ceeciyanoo tuusu

source: Close
ses: Daabu

source: Close All Tabs
ses: Kanjey kul daabu

source: Close Menu
ses: Šilbayboŋoo daabu

source: Close Private Tabs
ses: Sutura kanjey daabu

source: Close Selected Tab
ses: Kanji suubantey daabu

source: Close Tab
ses: Kanjoo daabu

source: Closing tab
ses: Kanji daabuyan

source: computer
ses: ordinater

source: Connect Another Device
ses: Jinay tana dobu

source: Connect Firefox everywhere you use it.
ses: Firefox dobu nungu kul kaŋ ra n g'a ka goy.

source: Content trackers
ses: Gundekuna ganakey

source: Cookies
ses: Aleewa

source: Copy
ses: Berandi

source: Copy Address
ses: Aderesu berandi

source: Copy Image
ses: Biyoo berandi

source: Copy Link
ses: Doboo bere

source: Copy URL
ses: URL berandi

source: Could not add page to Reading list
ses: Mana hin ka moɲoo tonton caw maašeedaa ga

source: Could not add page to Reading List. Maybe it's already there?
ses: Mana hin ka moɲoo tonton caw maašeedaa ga. Adiši a goo no ka ben?

source: Could not add page to Reading List. Maybe it’s already there?
ses: Mana hin ka moɲoo tonton caw maašeedaa ga. Adiši a goo no ka ben?

source: Could not load page.
ses: Mana hin ka moɲoo zumandi.

source: Create an account
ses: Kontu tee

source: Current Homepage
ses: Sohõda sintinmoɲoo

source: Customize
ses: Hanse war boŋše

source: Customize Top Sites
ses: Nungu kaasey hanse war boŋ se

source: Dark
ses: Kubay

source: Data Management
ses: Bayhaya juwalyan

source: %d device(s) connected
ses: Jinay dobante %d

source: Debug: forget Sync auth state
ses: Hanse: dirŋa Sync duɲe alhaali

source: Debug: require password
ses: Hanse: šennikufal ga waažibi

source: Debug: require upgrade
ses: Hanse: taagandiyan ga waažibi

source: Debug: use stage servers
ses: Hanse: goy nda šiiyan feršikey

source: Decrease text size
ses: Hantum azzaati kaynandi

source: Default Search Engine
ses: Tilasu ceecijinay

source: Default Themes
ses: Tilasu furarey

source: Delete
ses: Tuusu

source: Delete from History
ses: Kaa taarikoo ra

source: Deselect All
ses: Ikul naŋ

source: Desktop Bookmarks
ses: Ordinater doo-šilbawey

source: Device Name
ses: Jinay maa

source: Disable additional page dialogs
ses: Moo willandi tontonantey kayandi

source: Disable for this site
ses: A wii nungoo woo se

source: Disable Night Mode
ses: Cijinhere alhaali wii

source: Disconnect
ses: Dunbu

source: Disconnect Sync
ses: Hun Sync ga

source: Disconnect Sync?
ses: Hun Sync ga?

source: Display
ses: Cebe

source: Display Settings
ses: Kayandiyaney cebe

source: Done
ses: A ben

source: Don’t Save
ses: Ma ši gaabundi

source: Don't Send
ses: Ma ši a sanba

source: Don’t Send
ses: Ma ši a sanba

source: Don’t Update
ses: Ma ši taagandi

source: Double tap and hold to open history
ses: Karkar nd'a gaabu ka taarikoo feeri

source: Download Cancelled
ses: Zumandiyanoo naŋandi

source: Downloaded Files
ses: Tuku zumantey

source: Downloaded files will show up here.
ses: Tuku zumantey ka cebandi ne.

source: Download Failed
ses: Zumandiyanoo kaŋ

source: Download Link
ses: Doboo zumandi

source: Download Now
ses: Zumandi sohõ

source: Downloads
ses: Zumandiyaney

source: Downloads aren't supported in Firefox yet.
ses: Zumandiyaney ši koy Firefox bande jina.

source: Do you want to save the password for %1$@ on %2$@?
ses: War ga boona ka šennikufal gaabu %1$@ se %2$@ ga?

source: Do you want to save the password on %@?
ses: War ga boona ka šennikufaloo gaabu %@ ga?

source: Do you want to update the password for %1$@ on %2$@?
ses: War ga boona ka šennikufal taagandi %1$@ se %2$@ ga?

source: Do you want to update the password on %@?
ses: War ga boona ka šennikufaloo taagandi %@ ga?

source: Do you want to use this web page as your home page?
ses: War ga boona ka interneti moɲoo woo tee war se šintin moo?

source: %d tab(s) closed
ses: Kanji %d daaba

source: Easily switch between open pages with tabs.
ses: Kanjey ka moo feerantey bere nda faala.

source: Edit
ses: Fasal

source: Enable
ses: Tunandi

source: Enable for this site
ses: Tunandi nungoo woo se

source: Enable Night Mode
ses: Cijinhere alhaali tunandi

source: Enable Tracking Protection
ses: Ganayan jejebu tunandi

source: Enter a new passcode
ses: Bisayankufal taaga dam

source: Enter a passcode
ses: Bisayankufal dam

source: Enter a webpage
ses: Interneti moo dam

source: Enter passcode
ses: Bisayankufal dam

source: Enter Passcode
ses: Bisayankufal dam

source: Enter Search Mode
ses: Ceeciyan alhaali dam

source: Enter your password to connect
ses: War šennikufaloo dam ka ciya

source: Enter your password to connect.
ses: War šennikufaloo dam ka ciya.

source: Face ID & Passcode
ses: Face ID nda Bisayankufal

source: Failed
ses: Kaŋyan

source: Failed to Add Pass
ses: Mana hin ka Pass tonton

source: Filter Sites
ses: Interneti nungey fay

source: Find
ses: Ceeci

source: Find in Page
ses: Ceeci moɲoo ra

source: Find In Page
ses: Ceeci moɲoo ra

source: Firefox Account
ses: Firefox kontu

source: Firefox and the cloud
ses: Firefox nda duulaa

source: Firefox cannot open the page because it has an invalid address.
ses: Firefox ši hin ka moɲoo feeri zama woo šii nda aderesu boryo.

source: Firefox Credentials
ses: Firefox alhaku tammaasawey

source: Firefox Downloads
ses: Firefox zumandiyaney

source: Firefox Home Page
ses: Firefox šintin moo

source: Firefox is blocking parts of the page that may track your browsing.
ses: Firefox goo ma moɲoo cerawey gagay kaŋ ga hin ka war naarumaa gana.

source: Firefox is unable to download or display this file. Would you like to open it in another app?
ses: Firefox ši hin ka tukoo woo zumandi wal'a cebe. War ga boona k'a feeri nda porogaram tana?

source: Firefox needs to reopen for this change to take effect.
ses: A ga hima Firefox ma feera taaga k'alhaaloo woo dii.

source: Firefox Sync has connected to %@
ses: Firefox Sync dobu %@ ga

source: Firefox will place things here that you've discovered on the web so you can find your way back to the great articles, videos, bookmarks and other pages
ses: Firefox ga hayey kaŋ war duu yey interneti dam ne hala war ma hin ka dii fondaa kaŋ ga feeri hantum, widewo, doo-šilbay nda moo tana suubanteyaŋ ga

source: Firefox will stop syncing with your account, but won’t delete any of your browsing data on this device.
ses: Firefox ši war kontoo hangandi koyne, amm'a ši war ceeciyan taariki bayhaya kul tuusu jinaa woo ga.

source: Firefox won't remember any of your history or cookies, but new bookmarks will be saved.
ses: Firefox ši honga taariki wala aleewa kul, amm'a ga doo-šilbay taagey gaabu.

source: Firefox won’t remember any of your history or cookies, but new bookmarks will be saved.
ses: Firefox ši honga taariki wala aleewa kul, amm'a ga doo-šilbay taagey gaabu.

source: Firefox would like to access your Photos
ses: Firefox ga boona ka too war biyey do

source: Folder
ses: Foolo

source: Folder Name
ses: Fooloo maa

source: Forward
ses: Jine

source: General
ses: Hayakul

source: Get your open tabs, bookmarks, and passwords from your other devices.
ses: War kanji feerantey, doo-šilbawey nda šennikufaley zaa jinay taney ga.

source: Get your tabs, bookmarks, and passwords from your other devices.
ses: Wa war jinay tanawey kanjey, doo-šilbawey nda šennikufaley zaa.

source: Go
ses: Koy

source: Go Back
ses: Yee banda

source: Go to copied link
ses: Koy dobu berantaa ga

source: Go to copied link?
ses: Koy dobu berantaa ga?

source: Go to copied URL?
ses: Koy URL berantaa ga?

source: %@ has been successfully disconnected.
ses: %@ dobuyanoo feera ka boori.

source: Help
ses: Faaba

source: Hide
ses: Tugu

source: Hide Images
ses: Biyey tugu

source: Highlights
ses: Haya fellantey

source: History
ses: Taariki

source: History will be removed from all your connected devices. This cannot be undone.
ses: Taariki ga hun war jinay dobantey kul ga, tuusuyan kaŋ ši hin ka taafeeri.

source: Home
ses: Šintin

source: Homepage
ses: Šintinmoo

source: Homepage Settings
ses: Šintinmoo kayandiyaney

source: Immediately
ses: Sohõda tilyo

source: Incorrect passcode. Try again.
ses: Bisayankufal laala. Ceeci koyne.

source: Incorrect passcode. Try again (Attempts remaining: %d).
ses: Bisayankufal laala. Ceeci koyne (Šiiyan cindey: %d).

source: Increase text size
ses: Hantum azzaati tonton

source: Introductory slide %1$@ of %2$@
ses: Šintin cebebii %1$@%2$@ se

source: Intro Tour Carousel
ses: Carousel windiroo šintin

source: It may be a misconfiguration or tampering by an attacker. Proceed if you accept the potential risk.
ses: A ga tee kaŋ woo mana hanse ka boori wala zanbakaw k'a tee. Bisa nda war ga allamaanaa bay.

source: just now
ses: sohõda

source: Last modified %@
ses: Barmayyan koraa %@

source: Last month
ses: Handu koraa

source: Last synced: %@
ses: Hangandiyan koraa: %@

source: Last week
ses: Jirbiyye koraa

source: Learn More
ses: Bay ka tonton

source: Learn More.
ses: Bay ka tonton.

source: Learn more about how Tracking Protection blocks online trackers that collect your browsing data across multiple websites.
ses: Bay ka tonton taka kaŋ nda ganayan jejebu ka internet-ra ganakey kaŋ ga naaruyan bayhayan gagay nungu booboyaŋ game.

source: Licenses
ses: Duɲe kaddasey

source: Light
ses: Kaaray

source: Load in Background
ses: Zumandi bandafaari ra

source: Loading content…
ses: Ga gundekuna zumandi…

source: Loading in Firefox
ses: Goo ma zumandi Firefox ra

source: Load original page
ses: Ašsil moɲoo zumandi

source: Location
ses: Gorodoo

source: Log in
ses: Huru

source: Logins
ses: Huruyan tammaasawey

source: Logins will be permanently removed.
ses: Huruyan tammaasawey ka hun ka ben.

source: Logins will be removed from all connected devices.
ses: Huruyan tammaasawey ga hun jinay dobantey kul ga.

source: Log Out
ses: Fatta

source: Log Out?
ses: Fatta wala?

source: Looks like Firefox crashed previously. Would you like to restore your tabs?
ses: A hima kaŋ Firefox bay ka kaŋ. War ga boona ka kanjey yeeti?

source: Mail App
ses: Bataga porogaram

source: Manage Account & Devices
ses: Kontu nda jinawey juwal

source: Mark as Read
ses: Šilbay sand'a cawandi

source: Mark as Unread
ses: Šilbay sand'a mana cawandi

source: Maximum attempts reached. Please try again in an hour.
ses: Šiiyan hinnawey kul too. Ceeci koyne guuru foo ra.

source: Maximum attempts reached. Please try again later.
ses: Šiiyan hinnawey kul too. Ceeci koyne kayna da.

source: Menu
ses: Šilbayboŋ

source: Missing error
ses: Firka kumante

source: Missing message
ses: Alhabar kumante

source: Mobile Bookmarks
ses: Doo-šilbay dirantey

source: mobile device
ses: kanbe jinay

source: More
ses: Ka tonton

source: More Info…
ses: Alhabar tontoni…

source: more than a month ago
ses: a ga bisa handu foo

source: more than a week ago
ses: a ga bisa jirbiyye foo

source: Mozilla strives to only collect what we need to provide and improve Firefox for everyone.
ses: Mozilla ga durkutu ka alhabar de marga kaŋ ir g'a ka Firefox tee k'a boryandi borey kul se.

source: My Photos
ses: Ay biyey

source: Navigation Toolbar
ses: Naaruyan goyjinay zuu

source: New Folder
ses: Foolo taaga

source: New passcode must be different than existing code.
ses: Bisayankufal taaga ga hima ka waani nda ibarantaa.

source: New Private Tab
ses: Sutura kanji taaga

source: New Private Tab opened
ses: Sutura kanji taaga feera

source: New Tab
ses: Kanji taaga

source: New tab arrived from another device.
ses: Kanji taaga kaŋ hun jinay tana do.

source: New tab arrived in %@
ses: Kanji taaga kaŋ huru %@ ra

source: New Tab opened
ses: Kanji taaga feera

source: Next in-page result
ses: Jine moo-kuna hunyan

source: Next Page
ses: Jine moɲoo

source: Night Mode
ses: Cijin alhaali

source: Night Mode Off
ses: Cijin alhaali kaa

source: No
ses: Kala

source: No Internet Connection
ses: Interneti dobuyan šii

source: No logins found
ses: Huruyan tammaasayaŋ kul mana duwandi

source: Normal Browsing Mode
ses: Hankul naarumi alhaali

source: No tabs
ses: Kanji kul šii

source: Not now
ses: Manti sohõ

source: Not Now
ses: Manti sohõ

source: No tracking elements detected on this page.
ses: Ganayan jere kulyaŋ mana maatandi moɲoo woo ga.

source: Off
ses: Wii

source: Offer to Open Copied Links
ses: Noo dobu berantey se

source: Offline Website Data
ses: Interneti daabante nungu bayhaya

source: OK
ses: Ayyo

source: Okay
ses: Ayyo

source: On
ses: Ga dii

source: Only HTTP and HTTPS links can be shared.
ses: HTTP nda HTTPS dobey hinne ma hin ka žemnandi.

source: Only when using Tracking Protection
ses: Waati de kaŋ ganayan jejebu ga dira

source: Oops! Firefox crashed
ses: Aywa, Firefox kaŋ ya!

source: Open App Store
ses: Feeri App Store ra

source: Open articles in Reader View by tapping the book icon when it appears in the title bar.
ses: Citaabu biyoo kar nd'a bangay ka hantumey feeri cawkaw gunaroo ra maa zuwoo ra.

source: Open & Fill
ses: Feeri nda toonandi

source: Open in…
ses: Feeri ne…

source: Open in Firefox
ses: Feeri Firefox ra

source: Opening %@
ses: Goo ma %@ feeri

source: Open in New Private Tab
ses: Feeri sutura kanji taaga ra

source: Open in New Tab
ses: Feeri kanji taaga ra

source: Open in Private Mode
ses: Feeri sutura alhaali ra

source: Open in Safari
ses: Feeri Safari ra

source: Open Last Bookmark
ses: Doo-šilbay koraa feeri

source: Open Last Tab
ses: Kanji koraa feeri

source: Open mail links with
ses: Bataga dobey feeri nda

source: Open New Private Tab
ses: Sutura kanji taaga feeri

source: Open New Tab
ses: Kanji taaga feeri

source: Open Selected Tab
ses: Kanji suubante daabu

source: Open Settings
ses: Kayandiyaney feeri

source: Open Sync Preferences
ses: Sync ibaayey feeri

source: Open Tabs
ses: Kanji feerantey

source: Open this link in the App Store?
ses: Doboo woo feera App Store ra?

source: Organize
ses: Kanandi

source: Otherwise show in the toolbar
ses: Adiši cebe goyjinay zuwoo ra

source: Page Actions
ses: Moo teerawey

source: Page Options Menu
ses: Moo suubarey maaboŋ

source: Panel Chooser
ses: Fasaldoo suubakaw

source: Passcode
ses: Bisayan kufal

source: Passcode For Logins
ses: Bisayankufal huruyaney se

source: Passcodes didn't match. Try again.
ses: Bisayankufaley ši tenji. Ceeci koyne.

source: Passcodes didn’t match. Try again.
ses: Bisayankufaley ši tenji. Ceeci koyne.

source: password
ses: šennikufal

source: Password
ses: Šennikufal

source: Paste
ses: Dobu

source: Paste & Go
ses: Dobu nda bisa

source: Personalize your default search engine and more in Settings.
ses: War tilasu ceecijinaa nda suubari tana soolu kayandiyaŋey ra.

source: Personalize your Firefox just the way you like in Settings.
ses: Wa Firefox hanse war boŋ ibaayoo ra kayandiyaney ra.

source: Photos
ses: Biyey

source: Pick up where you left off
ses: Zaa noodin kaŋ war n'a naŋ

source: Pin to Top Sites
ses: Kanji sanda nungu kaasu

source: Please allow Firefox to access your device's camera in 'Settings' -> 'Privacy' -> 'Camera'.
ses: Naŋ Firefox ma duu war jinaa biizaahayaa 'Kayandiyaney' -> 'Sutura' -> 'Biizaahay' ra.

source: Please allow Firefox to access your device’s camera in ‘Settings’ -> ‘Privacy’ -> ‘Camera’.
ses: Naŋ Firefox ma duu war jinaa biizaahayaa ‘Kayandiyaney’ -> ‘Sutura’ -> ‘Biizaahaya’.

source: Please allow Firefox to access your device’s camera in ’Settings’ -> ’Privacy’ -> ’Camera’.
ses: Naŋ Firefox ma duu war jinaa biizaahayaa 'Kayandiyaney' -> 'Sutura' -> 'Biizaahay' ra.

source: Please fill all fields correctly.
ses: Faarey kul toonandi ka boori.

source: Please open Firefox, go to Settings and sign in to continue.
ses: Firefox feeri, koy Kayandiyaney do nda goykaw maa hantum ka bisa.

source: Preview
ses: Moofur

source: Preview of %@
ses: Moofur %@ se

source: Preview Theme
ses: Moofur furari

source: Previous in-page result
ses: Banda moo-kuna hunyan

source: Privacy
ses: Sutura

source: Privacy Policy
ses: Sutura laada

source: Private Browsing
ses: Sutura ceeciyan

source: Private Browsing Mode
ses: Sutura naarumi alhaali

source: Private Mode
ses: Sutura alhaali

source: Quick-Search Engines
ses: Ceecijinay cahãntey

source: read
ses: caw

source: Reader Mode available
ses: Cawyan alhaali barante

source: Reader View
ses: Cawkaw gunari

source: Reading list
ses: Caw maašeede

source: Reading List
ses: Caw maašeede

source: Recent Bookmarks
ses: Doo-šilbay kokorantey

source: Recently Closed
ses: Kanjey kaŋ kokor ka daaba

source: Re-enter passcode
ses: Bisayankufal dam taaga

source: Reload
ses: Dam taaga

source: Reload Page
ses: Moo dam taaga

source: Reload Without Tracking Protection
ses: Zumandi taaga bila nda ganayan jejebu

source: Reload With Tracking Protection
ses: Zumandi taaga nda ganayan jejebu

source: Remote Clients
ses: Daykaw moorey

source: Remove
ses: Kaa

source: Remove Bookmark
ses: Doo-šilbaa kaa

source: Remove from Reading List
ses: Kaa caw maašeedaa ra

source: Remove history from your Firefox Account?
ses: Taariki kaa war Firefox kontey kul ga wala?

source: Remove page — %@
ses: Moɲoo kaa — %@

source: Remove Pinned Site
ses: Kaa nungu kaasey ra

source: Reopen Closed Tab
ses: Kanji daabantey feeri taaga

source: Request Desktop Site
ses: Ordinater nungu hãa

source: Request Mobile Site
ses: Kanbehaya nungu hãa

source: Require Passcode
ses: Bisayankufal waažibandi

source: Resend Email
ses: Batagaa sanda taaga

source: Reset text size
ses: Hantum azzaati yeeti

source: Resume
ses: Šintin taaga

source: Retry
ses: Ceeci taaga

source: Reveal
ses: Bangandi

source: Sans-serif
ses: Šigira šerrante

source: Save
ses: Gaabu

source: Saved Logins
ses: Huruyan maa gaabuntey

source: Save Image
ses: Bii gaabu

source: Save Login
ses: Huruyan tammaasa gaabu

source: Save login %1$@ for %2$@?
ses: Huruyan tammaasa %1$@ gaabu %2$@ se?

source: Save Logins
ses: Huruyan maaɲey gaabu

source: Save pages to your Reading List by tapping the book plus icon in the Reader View controls.
ses: Citaabu nda bii karkar cawkaw gunari dabarey ra ka moɲey gaabu war cawyan maašeedaa ga.

source: Save password for %@?
ses: Šennikufal gaabu %@ se?

source: Scan QR Code
ses: QR tammaasa bii za

source: %@ search
ses: %@ ceeci

source: Search
ses: Ceeci

source: Search Engine
ses: Ceecijinay

source: Searches for the suggestion
ses: Honnandiyan ceeciyaney

source: Search in Firefox
ses: Ceeci Firefox ra

source: Searching for something different? Choose another default search engine (or add your own) in Settings.
ses: Goo ma guna haya kaŋ ga waani? Tilasu ceeciyan jinay tana suuba (wala war boŋ wane tonton) Kayandiyaney ra.

source: Search Input Field
ses: Damhaya faari ceeci

source: Search or enter address
ses: Ceeci wala aderesu dam

source: Search Settings
ses: Ceeciyan kayandiyaney
